print("\t\t\t\t\t Калькуляція фарбування кімнати")

довжина = float(input("введіть довжину, метри: ")) 
ширина = float(input("введіть ширину, метри: "))
висота = float(input("введіть висоту, метри: "))
фарба = float(input("введіть вартість 1л фарби, грн: "))
двері_вікна_Ш =float(input("введіть ширину дверей та вікон,  метри: "))
двері_вікна_В =float(input("введіть висоту дверей та вікон,  метри: "))

сонстанта = 2 # на 1 метр квадратній-уходит 2 л краски

print("площа квартири в метрах квадратних", довжина * висота + ширина * висота , "метров квадратних")
print("площа вікон та дверей в метрах квадратних", двері_вікна_В * двері_вікна_Ш , "метров квадратних")
print("площа квартири для фарбування в метрах квадратних", (довжина * висота + ширина * висота) - (двері_вікна_В * двері_вікна_Ш), "метров квадратних")
print("вартість загальнгоі фарби для фарбування квартири", (сонстанта * фарба) * ((довжина * висота + ширина * висота) - (двері_вікна_В * двері_вікна_Ш)), "грн") 